app/Controllers/CarritoController.php

    public function index()
    {
        $NameModel = new ProductoModel();
        $data['productos'] = $NameModel->orderBy('id_producto', 'DESC')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id_producto` DESC

    public function comprar_carrito(){
        $NameModel = new ProductoModel();
        $categorias['categorias'] = $NameModel->seleccionar_categoria();
        helper(['form', 'uri']);
        $request = \Config\Services::request();
        $cart = \Config\Services::cart();
        $cart->contents();

		$venta = array(
			'fecha' 		=> date('Y-m-d'),
			'id_usuario' 	=> session()->get('id_usuario'),
			'total_ventas'	=>  $cart->total(),
		);

        $ModelCabecera = new CabeceraVentaModel();
        $venta_id = $ModelCabecera->insert($venta); //inserta en la tabla venta_cabecera

		$cliente = [
            'email' => $this->request->getPost('email'),
            'telefono' => $this->request->getPost('telefono'),
            'nombre' => $this->request->getPost('nombre'),
            'apellido' => $this->request->getPost('apellido'),
            'direccion' => $this->request->getPost('direccion'),
            'ciudad' => $this->request->getPost('ciudad'),
            'cod_postal' => $this->request->getPost('cod_postal')
        ];

		$ModelCliente = new ClienteModel();
        $orden['clientes'] = $ModelCliente->insert($cliente);
---
INSERT INTO `cabecera_ventas` (`fecha`, `id_usuario`, `total_ventas`) VALUES ('2022-08-30', '8', 25000)
INSERT INTO `clientes` (`email`, `telefono`, `nombre`, `apellido`, `direccion`, `ciudad`, `cod_postal`) VALUES ('agustinn35@outlook.es', '32432', 'Alfredo', 'Ramirez', 'roca 850', 'corrientes', '3400')

					'total' 		=> $item['subtotal']
					);
            	$ModelDetalle = new DetalleVentaModel();
                $ventaTotal = $ModelDetalle->insert($detalle_venta); //inserta en la tabla venta_detalle
---
INSERT INTO `Detalle_ventas` (`id_ventas`, `id_cliente`, `id_producto`, `cantidad`, `precio`, `total`) VALUES (340, (322), '25', 5, 5000, 25000)

    public function mostrar_compra($id = null)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('Detalle_ventas');
        $builder->select('*');
        $builder->join('productos', 'productos.id_producto = detalle_ventas.id_producto');
        $builder->join('cabecera_ventas', 'cabecera_ventas.id_ventas = detalle_ventas.id_ventas');
        $builder->join('clientes', 'clientes.id_cliente = detalle_ventas.id_cliente');
        $query = $builder->get();
---
SELECT *
FROM `Detalle_ventas`
JOIN `productos` ON `productos`.`id_producto` = `detalle_ventas`.`id_producto`
JOIN `cabecera_ventas` ON `cabecera_ventas`.`id_ventas` = `detalle_ventas`.`id_ventas`
JOIN `clientes` ON `clientes`.`id_cliente` = `detalle_ventas`.`id_cliente`