app/Controllers/LoginController.php

SELECT *
FROM `productos`
ORDER BY `id_producto` DESC
---
    public function inicio()
    {
        $NameModel = new ProductoModel();
        $data['productos'] = $NameModel->orderBy('id_producto', 'DESC')->findAll();