app/Models/ProductoModel.php

UPDATE `productos` SET `stock` = stock - 5
WHERE `id_producto` = '25'
---
    public function actualizar_stock($id_producto, $cantidad){
        $this->set('stock', "stock - $cantidad", FALSE);
        $this->where('id_producto', $id_producto);
        $this->update();

SELECT *
FROM `categorias`
---
    public function seleccionar_categoria(){
        $db      = \Config\Database::connect();
        $builder = $db->table('categorias');
        $builder->select('*');
        $query = $builder->get();